### Lecutre 12a

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [6]:
sibs = ['alice', 'bob', 'carol', 'daisy']
ages = [19, 7, 12, 3]
foods = ['sushi', 'tacos', 'kiwi', 'skittles']
animals = ['unicorn', 'panda', 'monkey', 'rhino']
sib_data = list(zip(ages, foods, animals))

Panda: data analysis  
economic analysis  
built on numpy

In [8]:
sib_data

[(19, 'sushi', 'unicorn'),
 (7, 'tacos', 'panda'),
 (12, 'kiwi', 'monkey'),
 (3, 'skittles', 'rhino')]

### Series  
A Series is like a dictionary but it is ordered. So you can call a value by a calling the index. Dictionary items can only be called using the key.

In [10]:
pd.Series(ages) # series: kind of like array/dictionary

0    19
1     7
2    12
3     3
dtype: int64

In [11]:
sib_ages = pd.Series(ages, index=sibs) # index are like keys in dictionary
sib_ages

alice    19
bob       7
carol    12
daisy     3
dtype: int64

In [12]:
type(sib_ages)

pandas.core.series.Series

In [13]:
sib_ages.values #output an array

array([19,  7, 12,  3])

In [14]:
sib_ages.index

Index(['alice', 'bob', 'carol', 'daisy'], dtype='object')

In [15]:
type(sib_ages.index) #type = pandas index

pandas.core.indexes.base.Index

In [16]:
sib_ages[2]

/var/folders/2m/ffpxvj6x6y9_869rd2330sl00000gn/T/ipykernel_19068/1067640998.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sib_ages[2]

12

In [17]:
sib_ages['carol']

12

In [18]:
sib_ages[:2]

alice    19
bob       7
dtype: int64

In [19]:
sib_ages[['alice', 'carol']]

alice    19
carol    12
dtype: int64

In [20]:
'bob' in sib_ages

True

In [21]:
'edgar' in sib_ages

False

In [22]:
sib_ages > 10

alice     True
bob      False
carol     True
daisy    False
dtype: bool

In [23]:
sib_ages[sib_ages > 10]

alice    19
carol    12
dtype: int64

In [24]:
sib_ages[(sib_ages > 10) & (sib_ages < 18)]

carol    12
dtype: int64

In [25]:
sib_ages[sib_ages.between(12, 19)] # closed interval, includes endpts

alice    19
carol    12
dtype: int64

In [26]:
sib_ages[sib_ages.isin([3, 7])]

bob      7
daisy    3
dtype: int64

### DataFrames

In [28]:
sib_data

[(19, 'sushi', 'unicorn'),
 (7, 'tacos', 'panda'),
 (12, 'kiwi', 'monkey'),
 (3, 'skittles', 'rhino')]

In [29]:
pd.DataFrame(sib_data)

    0         1        2
0  19     sushi  unicorn
1   7     tacos    panda
2  12      kiwi   monkey
3   3  skittles    rhino

In [30]:
df_sib = pd.DataFrame(sib_data, index=sibs, columns=['age', 'food', 'animal'])
df_sib

       age      food   animal
alice   19     sushi  unicorn
bob      7     tacos    panda
carol   12      kiwi   monkey
daisy    3  skittles    rhino

In [31]:
len(df_sib)

4

In [32]:
type(df_sib)

pandas.core.frame.DataFrame

In [33]:
df_sib.shape

(4, 3)

In [34]:
df_sib.columns

Index(['age', 'food', 'animal'], dtype='object')

In [35]:
df_sib.index

Index(['alice', 'bob', 'carol', 'daisy'], dtype='object')

In [36]:
df_sib.values

array([[19, 'sushi', 'unicorn'],
       [7, 'tacos', 'panda'],
       [12, 'kiwi', 'monkey'],
       [3, 'skittles', 'rhino']], dtype=object)

### Accessing Rows

In [38]:
df_sib.loc['carol']

age           12
food        kiwi
animal    monkey
Name: carol, dtype: object

In [39]:
df_sib.loc['alice': 'carol']

       age   food   animal
alice   19  sushi  unicorn
bob      7  tacos    panda
carol   12   kiwi   monkey

In [40]:
df_sib.iloc[:3]

       age   food   animal
alice   19  sushi  unicorn
bob      7  tacos    panda
carol   12   kiwi   monkey

### Accessing Columns

In [42]:
df_sib['food'] # brackets and quotes required when creating a new column

alice       sushi
bob         tacos
carol        kiwi
daisy    skittles
Name: food, dtype: object

In [43]:
df_sib.food # shortcut, doesn't work if col name have spaces
            # begin with numbers
            # if math python function/keyword

alice       sushi
bob         tacos
carol        kiwi
daisy    skittles
Name: food, dtype: object

In [44]:
df_sib[['food', 'age']]

           food  age
alice     sushi   19
bob       tacos    7
carol      kiwi   12
daisy  skittles    3

In [45]:
df_sib.iloc[:, [1, 0]]

           food  age
alice     sushi   19
bob       tacos    7
carol      kiwi   12
daisy  skittles    3

In [46]:
df_sib

       age      food   animal
alice   19     sushi  unicorn
bob      7     tacos    panda
carol   12      kiwi   monkey
daisy    3  skittles    rhino

### Adding a Column

In [48]:
df_sib['is_child'] = df_sib.age < 18 # must use bracket notation

In [49]:
df_sib

       age      food   animal  is_child
alice   19     sushi  unicorn     False
bob      7     tacos    panda      True
carol   12      kiwi   monkey      True
daisy    3  skittles    rhino      True

### Sorting a DataFrame column

In [51]:
df_sib.sort_values(by='age')

       age      food   animal  is_child
daisy    3  skittles    rhino      True
bob      7     tacos    panda      True
carol   12      kiwi   monkey      True
alice   19     sushi  unicorn     False

In [52]:
df_sib.sort_values(by='age', ascending=False) # makes a copy

       age      food   animal  is_child
alice   19     sushi  unicorn     False
carol   12      kiwi   monkey      True
bob      7     tacos    panda      True
daisy    3  skittles    rhino      True

In [53]:
df_sib.sort_values(by='age', ascending=False, inplace=True) # modify df_sib

In [54]:
df_sib

       age      food   animal  is_child
alice   19     sushi  unicorn     False
carol   12      kiwi   monkey      True
bob      7     tacos    panda      True
daisy    3  skittles    rhino      True

### IMDB Reading

In [57]:
dfmovie = pd.read_csv('imdb-movie.csv', index_col='Title')
dfmovie

,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,
Star Wars: Episode VII - The Force Awakens,"Action,Adventure,Fantasy",Three decades after the defeat of the Galactic...,J.J. Abrams,"Daisy Ridley, John Boyega, Oscar Isaac, Domhna...",2015,136,8.1,661608,936.63,81.0
Avatar,"Action,Adventure,Fantasy",A paraplegic marine dispatched to the moon Pan...,James Cameron,"Sam Worthington, Zoe Saldana, Sigourney Weaver...",2009,162,7.8,935408,760.51,83.0
Jurassic World,"Action,Adventure,Sci-Fi","A new theme park, built on the original site o...",Colin Trevorrow,"Chris Pratt, Bryce Dallas Howard, Ty Simpkins,...",2015,124,7.0,455169,652.18,59.0
The Avengers,"Action,Sci-Fi",Earth's mightiest heroes must come together an...,Joss Whedon,"Robert Downey Jr., Chris Evans, Scarlett Johan...",2012,143,8.1,1045588,623.28,69.0
The Dark Knight,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.32,82.0
...,...,...,...,...,...,...,...,...,...,...
This Beautiful Fantastic,"Comedy,Drama,Fantasy",A young woman who dreams of being a children's...,Simon Aboud,"Jessica Brown Findlay, Andrew Scott, Jeremy Ir...",2016,100,6.9,688,NaN,51.0
Triangle,"Fantasy,Mystery,Thriller",The story revolves around the passengers of a ...,Christopher Smith,"Melissa George, Joshua McIvor, Jack Taylor,Mic...",2009,99,6.9,72533,NaN,66.0
True Crimes,"Crime,Drama,Thriller",A murder investigation of a slain business man...,Alexandros Avranas,"Jim Carrey, Charlotte Gainsbourg, Marton Csoka...",2016,92,7.3,198,NaN,43.0
Twin Peaks: The Missing Pieces,"Drama,Horror,Mystery",Twin Peaks before Twin Peaks (1990) and at the...,David Lynch,"Chris Isaak, Kiefer Sutherland, C.H. Evans, Sa...",2014,91,8.1,1973,NaN,NaN
Winter's Bone,Drama,An unflinching Ozark Mountain girl hacks throu...,Debra Granik,"Jennifer Lawrence, John Hawkes, Garret Dillahu...",2010,100,7.2,116435,NaN,NaN

In [59]:
dfmovie.tail(2)

,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,
Twin Peaks: The Missing Pieces,"Drama,Horror,Mystery",Twin Peaks before Twin Peaks (1990) and at the...,David Lynch,"Chris Isaak, Kiefer Sutherland, C.H. Evans, Sa...",2014,91,8.1,1973,NaN,NaN
Winter's Bone,Drama,An unflinching Ozark Mountain girl hacks throu...,Debra Granik,"Jennifer Lawrence, John Hawkes, Garret Dillahu...",2010,100,7.2,116435,NaN,NaN

In [61]:
dfmovie.info()

<class 'pandas.core.frame.DataFrame'>
Index: 500 entries, Star Wars: Episode VII - The Force Awakens to Winter's Bone
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Genre               500 non-null    object
 1   Description         500 non-null    object
 2   Director            500 non-null    object
 3   Actors              500 non-null    object
 4   Year                500 non-null    int64
 5   Runtime (Minutes)   500 non-null    int64
 6   Rating              500 non-null    float64
 7   Votes               500 non-null    int64
 8   Revenue (Millions)  465 non-null    float64
 9   Metascore           467 non-null    float64
dtypes: float64(3), int64(3), object(4)
memory usage: 43.0+ KB

In [63]:
dfmovie.describe() #for numerical data

,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,500.000000,500.000000,500.000000,5.000000e+02,465.000000,467.000000
mean,2012.166000,119.494000,7.461000,2.486979e+05,99.529118,69.051392
std,3.319712,19.779596,0.444042,2.246276e+05,121.446885,13.389571
min,2006.000000,66.000000,6.800000,6.100000e+01,0.010000,23.000000
25%,2009.000000,105.000000,7.100000,8.955050e+04,14.670000,60.000000
50%,2013.000000,117.000000,7.400000,1.998365e+05,54.120000,70.000000
75%,2015.000000,130.250000,7.800000,3.465072e+05,141.320000,79.000000
max,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

In [65]:
dfmovie.loc['Avatar']

Genre                                          Action,Adventure,Fantasy
Description           A paraplegic marine dispatched to the moon Pan...
Director                                                  James Cameron
Actors                Sam Worthington, Zoe Saldana, Sigourney Weaver...
Year                                                               2009
Runtime (Minutes)                                                   162
Rating                                                              7.8
Votes                                                            935408
Revenue (Millions)                                               760.51
Metascore                                                          83.0
Name: Avatar, dtype: object

In [67]:
dfmovie.Year.describe()

count     500.000000
mean     2012.166000
std         3.319712
min      2006.000000
25%      2009.000000
50%      2013.000000
75%      2015.000000
max      2016.000000
Name: Year, dtype: float64

In [75]:
dfmovie.Year = dfmovie.Year.astype('category')

In [77]:
dfmovie.Year.describe()

count      500
unique      11
top       2016
freq       114
Name: Year, dtype: int64

In [79]:
dfmovie.Rating.max()

9.0

In [81]:
dfmovie.Rating.min()

6.8

In [89]:
dfmovie.Rating.nlargest(10)

Title
The Dark Knight          9.0
Inception                8.8
Dangal                   8.8
Interstellar             8.6
The Intouchables         8.6
Kimi no na wa            8.6
The Dark Knight Rises    8.5
The Departed             8.5
The Prestige             8.5
Whiplash                 8.5
Name: Rating, dtype: float64

In [91]:
dfmovie.Rating.mean()

7.461